 CREATE TABLE Artist (
        BandID int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
        BandName VARCHAR(100) NOT NULL,
        Member INT NOT NULL
        );

    CREATE TABLE Style(
        StyleID int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
        StyleName VARCHAR(100) NULL
        );
    
    CREATE TABLE Music(
        MusicID int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
        MusicName VARCHAR(100) NOT NULL,
        BandID VARCHAR(100) NOT NULL REFERENCES Artist(BandID),
        StyleID VARCHAR(100) NOT NULL REFERENCES Style(StyleID),
        Lyrics VARCHAR(2000) NOT NULL,
        AlbumID VARCHAR(100) NULL REFERENCES Album(AlbumID),
        SongLenght TIME NOT NULL
        );

    CREATE TABLE Album(
        AlbumID int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
        AlbumCoverPhoto VARCHAR(100) NOT NULL,
        AlbumName VARCHAR(100) NOT NULL,
        BandID VARCHAR(100) NOT NULL REFERENCES Artist(BandID),
        StyleID VARCHAR(100) NOT NULL REFERENCES Style(StyleID),
        ReleaseYear YEAR(4) NOT NULL
        );

INSERT INTO Artist (BandName, Member)
    VALUES ('ไมค์ ภิรมย์พร', '1'),
            ('BNK48', '16'),
            ('Bodyslam', '5'),
            ('Silly Fools', '4'),
            ('ไผ่ พงศธร', '1');
 
    INSERT INTO Style (StyleName)
    VALUES ('Thai Country'),
            ('Pop'),
            ('Rock');
    
    INSERT INTO Music (MusicName,BandID,StyleID,Lyrics,AlbumID,SongLenght)
    VALUES ('ยาใจคนจน','1','1','"เป็นแฟนคนจน ต้องทนหน่อยน้อง
พี่นี้ไม่มีเงินทอง มารองรับความลำบาก
ในแต่ละวัน พี่นั้นต้องทำงานหนัก
ถ้าไม่มีใจรัก ใครหนอจะร่วมทางได้
ปัญหามากมาย พาใจอ่อนล้า
ทั้งทั้งไม่เจตนา แต่ปัญหาก็มาจนได้
จึงอยากให้น้อง ช่วยมองด้วยความเห็นใจ
อุปสรรคจะมีเท่าใด ขอใจเรายิ้มให้กัน
ลำบากยากเข็ญ เช้าเย็นขอให้เห็นหน้า
เมื่อเจอปัญหา น้องอย่าตัดสายสัมพันธ์
อยู่เป็นแรงใจ เติมไฟให้กันและกัน
เพียงเรามีเราเท่านั้น สร้างฝันให้สมดังใฝ่
เป็นแฟนคนจน ต้องทนหน่อยน้อง
อย่าแคร์สายตาคนมอง อย่าหมองเมื่อยามแพ้พ่าย
อย่าเพิ่งด่วนลา เมื่อเจอปัญหาใดใด
ยืนเคียงเพื่อคอยยิ้มให้ เป็นยาชุบใจคนจน
เป็นแฟนคนจน ต้องทนหน่อยน้อง
อย่าแคร์สายตาคนมอง อย่าหมองเมื่อยามแพ้พ่าย
อย่าเพิ่งด่วนลา เมื่อเจอปัญหาใดใด
ยืนเคียงเพื่อคอยยิ้มให้ เป็นยาชุบใจคนจน"','1','00:03:30'),
        ('ขี้หึง','4','3','ยิ้มให้กับฉันหน่อย แค่หึงเล็กน้อยแค่คอยรัก
ได้โปรดอย่าโกรธฉัน ขนาดนั้นอีกนานคงขาดใจ
และไม่ใช่ไม่ไว้ใจ ใจฉันร้อนหากใครมองนัก
ก็เธอดันน่ารักขนาดนั้นให้มองอยู่ได้ไง
ช่วยเอียงมาหาหน่อย ฉันเฝ้าคอยที่จะบอกรัก
ได้โปรดอย่าโกรธฉันที่ทำไปนั้นจะไม่ทำอีกต่อไป
บางทีฉันก็ยั้งไม่อยู่ บางทีฉันก็รู้แต่ทนไม่ไหว
บางทีฉันใจร้อนเกินไป โปรดจงเข้าใจ
* ที่เป็นไปนะเป็นไปด้วยรัก
แต่อาจจะขี้หึงเกินไป แต่ใจทั้งใจมีแต่เธอคนเดียว
รักเธอคนเดียวไม่ยอมให้ใครมาเปลี่ยนไป
อยากให้เธอได้รู้ เฝ้าดูแล้วเข้าใจก่อน
หากใครทำใจฉันสั่นคลอน เธอจะรู้สึกหึงและห่วงไหม','2','00:04:26'),
        ('คิดฮอดวันละหน่อย','5','1','เก็บคำว่าคิดฮอด หยอดกระปุกหัวใจ
สะสมไว้ในยามสองใจต้องห่าง
น้องคอยอยู่บ้านเฮา หากเหงาหรือคิดถีงจัง
เบิ่งดอกจานข้างทาง แทนอ้ายพลางพลางก่อนเด้อ
อ้ายมาเมืองฟ้าหม่น สู้เพื่อคนอยู่หลัง
สร้างความหวังด้วยแรงใจที่ล้นเอ่อ
รูปน้องในกระเป๋า ยามเหงาช่วยได้เสมอ
ไม่นานเฮาคงได้เจอ สบตาพลอดพร่ำคำหวาน
* คิดฮอดกันวันละน้อย ทยอยฮักกันให้นาน
ห่างหลายกิโลฝัน สัญญาอย่าให้เลือนหาย
คิดฮอดกันวันละน้อย ทยอยโทรเติมแรงใจ
ให้อ้ายยังคงยิ้มได้ ยามเหนื่อยล้าใจทุกครา
เก็บใจที่ฮักมั่น เฝ้าคอยวันที่หวัง
ยามอ้างว้าง นั่งคิดถึงวันคืนเก่า
ท้องทุ่งนาสีทอง เคยมีอ้ายน้องหยอกเย้า
สักวันหนึ่งสองเฮา คงได้ทบทวนความหลัง
* คิดฮอดกันวันละน้อย ทยอยฮักกันให้นาน
ห่างหลายกิโลฝัน สัญญาอย่าให้เลือนหาย
คิดฮอดกันวันละน้อย ทยอยโทรเติมแรงใจ
ให้อ้ายยังคงยิ้มได้ ยามเหนื่อยล้าใจทุกครา
เก็บใจที่ฮักมั่น เฝ้าคอยวันที่หวัง
ยามอ้างว้างนั่งคิดถึงวันคืนเก่า
ท้องทุ่งนาสีทอง เคยมีอ้ายน้องหยอกเย้า
สักวันหนึ่งสองเฮา คงได้ทบทวนความหลัง','3','00:03:55'),
        ('ความเชื่อ','3','3','มันเกือบจะล้มมันเหนื่อยมันล้าเหมือนแทบขาดใจ
เดินมาจนท้อไม่เจอจุดหมายปลายทางที่ฝัน
จะกลับดีไหมถ้าเดินต่อไปยากเย็นขนาดนั้น ยังถามใจ
ตลอดชีวิตฉันเชื่อในสิ่งที่คิด
หรือมันจะเป็นอะไรที่ผิด
และฉันเองที่หลงทาง
ชีวิตมันต้องเดินตามหาความฝัน
หกล้มคลุกคลานเท่าไหร่
มันจะไปจบที่ตรงไหน
เมื่อเดินเท่าไหร่มันก็ไปไม่ถึง เย้
เดินต่อช้าช้าไม่อยากปล่อยฝันให้มันหลุดมือ
ที่สั่งให้ฉันไปต่อก็คือความเชื่อเท่านั้น
ถ้าในวันนี้เรี่ยวแรงยังเหลือก็ยังต้องฝัน ต้องก้าวไป
ตลอดชีวิตฉันเชื่อในสิ่งที่คิด
แม้ไม่ว่ามันจะถูกหรือผิด
จะขอทำสุดหัวใจ
ชีวิตมันต้องเดินตามหาความฝัน
หกล้มคลุกคลานเท่าไหร่
มันจะไปจบที่ตรงไหน
แต่จะยังไงก็ต้องไปให้ถึง
ที่สุดถ้ามันจะไม่คุ้ม
แต่มันก็ดีที่อย่างน้อยได้จดจำว่าครั้งหนึ่งเคยก้าวไป
แค่คนที่เชื่อในความฝัน
จะเหน็ดจะเหนื่อยก็ยังต้องเดินต่อไป
ฉันท้อแท้สักกี่ทียังมีหวัง
แม้พลาดพลั้งสักกี่ครั้งยังฝันไกล
แม้ฉันล้มฉันก็คงไม่ตาย
ฉันยังไม่ตายฉันยังคงหายใจ
แม้ท้อแท้สักกี่ทียังมีหวัง
แม้พลาดพลั้งสักกี่ครั้งยังฝันไกล
แม้ฉันล้มฉันก็คงไม่ตาย
ฉันยังไม่ตายฉันยังคงหายใจ
ชีวิตมันต้องเดินตามหาความฝัน
หกล้มคลุกคลานเท่าไหร่
มันจะไปจบที่ตรงไหน
แต่จะยังไงก็ต้องไปให้ถึง (ก็ต้องไป ให้ถึง)
ที่สุดถ้ามันจะไม่คุ้ม
แต่มันก็ดีที่อย่างน้อยได้จดจำว่าครั้งหนึ่งเคยก้าวไป
แค่คนที่เชื่อในความฝัน
จะเหน็ดจะเหนื่อยก็ยังต้องเดินต่อไป
ฉันท้อแท้สักกี่ทียังมีหวัง (ต้องไป)
แม้พลาดพลั้งสักกี่ครั้งยังฝันไกล (ต้องไป)
แม้ฉันล้มฉันก็คงไม่ตาย (ฮือ)
ฉันยังไม่ตายฉันยังคงหายใจ (ต้องไป)
แม้ท้อแท้สักกี่ทียังมีหวัง (ต้องไป)
แม้พลาดพลั้งสักกี่ครั้งยังฝันไกล (ต้องไป)
แม้ฉันล้มฉันก็คงไม่ตาย (ฮือ)
ฉันยังไม่ตายฉันยังคงหายใจ โฮ','4','00:04:57'),
        ('Jabaja','2','2','Say jabaja
Jabaja jabaja jabaja
All night long
Jabaja jabaja in the groove yeah
เริ่มกันอีกครั้งเป็นไร
สูดหายใจให้เต็มปอด
อะไรที่ค้างในใจ
ช่างมัน
ทิ้งทิ้งไปก็แค่นั้นเอง
แม้ค่ำคืนนี้มืดมน
บนท้องฟ้าไร้ดวงดาราคอยส่องแสง
มาทำให้ค่ำคืนนี้
กลับสว่างไสวขึ้นมา
ผ่านแล้วเที่ยงคืนเลยเที่ยงคืนผ่านแล้ว
โยกย้าย
โยกย้าย
ปล่อยใจเต้นไปตามจังหวะ
ชีวิตเราเป็นของเราอีกครั้ง
Tonight tonight tonight yeah
ชีวิตไม่เคยหยุด
เวียนไปอยู่อย่างนี้
บางทีก็มีสุข
บางทีก็มีทุกข์
แค่ลองมาขยับ
เต้นกันค่ำคืนนี้
Jabaja funky night
All right
Jabaja jabaja jabaja
All night long
Jabaja jabaja in the groove yeah
อะไรที่ค้างในใจ
ลืมไปไม่ต้องไปเก็บ
ถ้าทำไม่ได้ดั่งใจ
ช่างมัน
เริ่มต้นดูใหม่ได้เลย
ถึงแม้ความรักมันทำ
ให้ฉันนั้นหลงไหลล่องลอยแค่ไหน
ความเศร้าหมองที่อยู่ในใจนั้น
มันไม่เคยจางหายสักที
ผ่านแล้วเที่ยงคืนเลยเที่ยงคืนผ่านแล้ว
โยกย้าย
โยกย้าย
ปล่อยใจเต้นไปตามจังหวะ
ลุกขึ้นมาครึกครื้นกันได้แล้ว
All right all right all right yeah
ชีวิตอย่ายึดติด
ดีร้ายอย่าไปคิด
บางทีก็มีสุข
บางทีก็มีทุกข์
แค่ลองมาขยับ
จูนใจให้คึกคัก
Jabaja crazy night
ความสับสน
ชั่วข้ามคืน
ณ ที่แห่งนี้ความวุ่นวายผ่านมา
บอกลาได้แล้ว
ตัวของเมื่อวาน
เรามาสะบัดปล่อยมันทิ้งไป
ผ่านแล้วเที่ยงคืนเลยเที่ยงคืนผ่านแล้ว
โยกย้าย
โยกย้าย
ปล่อยใจเต้นไปตามจังหวะ
ชีวิตเราเป็นของเราอีกครั้ง
Tonight tonight tonight yeah
ชีวิตไม่เคยหยุด
ยืนไปอยู่อย่างนี้
บางทีก็มีสุข
บางทีก็มีทุกข์
แค่ลองมาขยับ
เต้นกันค่ำคืนนี้
Jabaja funky night all right
Everybody (everybody)
Jabaja jabaja jabaja
All night long
Jabaja jabaja in the groove yeah','5','00:04:14');
 
 
    INSERT INTO Album (AlbumCoverPhoto,AlbumName,BandID,StyleID,ReleaseYear)
    VALUES ('ชุด 5 ยาใจคนจน','ชุด 5 ยาใจคนจน','1','1','1998'),
            ('Juicy','Juicy','4','3','2002'),
            ('ชุดที่ 1 ฝนรินในเมืองหลวง','ชุดที่ 1 ฝนรินในเมืองหลวง','5','1','2005'),
            ('Believe','Believe','3','3','2005'),
            ('Jabaja','Jabaja','2','2','2019');